# ImportedModelIsEmpty Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..ImportedModelIsEmpty Property
BuiltInFailures..::..ImportFailures Class See Also
---
Imported model is empty.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ImportedModelIsEmpty { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ImportedModelIsEmpty As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ImportedModelIsEmpty {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace